export interface historyData {
  id: number;
  name: string;
  description: string[];
}

export const data: historyData[] = [
  {
    id: 1,
    name: "컴퓨터 관련 분야 시작",
    description: [
      "대학교 졸업 후 여러 분야를 거치며 진로에 대한 고민을 다시 하게 됐습니다.",
      "우연히 웹디자인이라는 분야에 대해 알게 되고 교육을 받고 해당 분야에 진입했습니다. 무언가 내 손으로 만들고 나의 작업물을 실제로 사람들이 보고 사용하고 상품을 구매하는 과정으로 이어지는 게 흥미로웠습니다.",
      "지금도 이런 점이 업무를 하는 나에게 가장 큰 의미를 형성합니다.",
    ],
  },
  {
    id: 2,
    name: "콘텐츠 디자이너",
    description: [
      "포토샵 위주로 일러스트레이터는 보조용으로 디자인 작업을 진행했습니다. 폰트에 대한 활용, 저작권 개념을 알게 되었습니다. 이미지나 레이아웃이 디자인에서 하는 역할과 디자이너가 가져야 하는 비즈니스적인 마인드, 클라이언트(상사, 책임자, MD, 외부 인원 등)나 결정자가 되는 사람들과 어떻게  소통하고 작업해야 하는지를 배우게 되었습니다. 실무에서는 매우 중요한 내용이었습니다.",
      "비전공자 출신으로 전공자들의 작업물과 비교하여 부족한 점이 매우 많았습니다. 디자인 실력이 뛰어난 동료 그리고 선임 디자이너에게 많은 피드백과 도움을 구하며 처음에 비해 많은 성장을 이룰 수 있었습니다.",
    ],
  },
  {
    id: 3,
    name: "쇼핑몰 운영 및 각종 외주 업무",
    description: [
      "지인이 운영하는 쇼핑몰의 디자인 작업, 상품 등록, 배송 관리 등을 직접 맡아서 진행했습니다. 각 커머스에 상품을 올려주는 프로그램을 사용하고 썸네일이나 상세페이지를 만들며 주문이 들어오면 물건을 포장해서 배송했습니다.",
      "네이버 스마트스토어, 카페24에서 사이트를 수정하거나 이벤트 내용을 위해 각종 변경 기능을 찾아 봤습니다.",
      "유튜브 썸네일, 이벤트 배너 등을 만들고 상품의 소구점을 나타내는 상세페이지 제작이나 행사에 활용하는 포스터 제작, 명함 등을 제작해서 인쇄소에 의뢰하기 같이 실제 환경 속 다양한 상황에 부딪혀 보게 되었습니다.",
      "웹퍼블리싱에 필요한 내용들도 공부를 하며 모바일 청첩장 같은 것을 제작하기도 했습니다.",
    ],
  },
  {
    id: 4,
    name: "컴퓨터 학원 강사",
    description: [
      "컴퓨터 학원에서 강의할 기회가 주어지게 되었습니다. 학생 때, 발표를 많이 했었고 누군가에게 설명하길 좋아하는 성격이라 좋은 기회라고 생각했습니다.",
      "잘 아는 프로그램이라고 생각했지만 누군가에게 설명한다는 일이 쉽지 않았고, 용어부터 다시 공부를 해야 했습니다.",
      "교육 과정에 완벽히 숙지하지 못한 내용도 있고, 업계 특성상 지속적으로 업데이트가 이뤄지다보니 늘 새롭게 공부하며 강의를 해야 했습니다.",
      "의외로 어렸을 적 각종 서비스 업장에서 했던 알바와 전공을 공부하며 다양한 사람들을 겪어왔던 것들이 많은 도움이 됐습니다.",
      "그동안의 연관성 없다고 생각한 경험들도 나에게 영향을 주고 큰 힘이 될 수 있다는 것을 깨달았습니다.",
    ],
  },
  {
    id: 5,
    name: "웹디자이너 & 웹퍼블리셔",
    description: [
      "화면에 나타내는 디자인, 그리고 웹퍼블리싱까지 이어지는 업무를 담당하게 되었습니다. 솔루션 업체에서 사내 개발자들과 소통하며 작업을 진행했습니다.",
      "사내에 영업, QA 등의 인원들도 대부분 개발자 출신이었습니다. 그래서 개발 위주의 분위기와 작업이 진행되었고 그런 부분이 저에게 개발에 대한 의문과 필요성으로 다가왔습니다.",
      "화면을 디자인할 때, 구현까지 할 것을 고려해서 작업을 해야 했고, 그 이후 개발 영역의 작업을 위해서는 어떤 부분을 고려해야 하는지 고민하게 됐습니다.",
    ],
  },
  {
    id: 6,
    name: "UI/UX디자이너 & 프론트엔드 개발자",
    description: [
      "PC위주의 환경을 위한 작업물을 주로 진행하다가 모바일 앱을 위한 작업을 해야 했습니다. 기초적인 개념들은 알고 있었지만, 실제 환경에서 고민해야 할 부분에 대한 경험이 모자랐습니다.",
      "모바일의 다양한 환경과 대표적인 운영체제들에서 진행해야 할 작업들을 배우게 되었습니다.",
      "그러고 웹퍼블리셔로 역할적인 한계를 느끼며 프론트엔드 개발자가 되기 위한 공부를 했습니다. FE개발자로써 서버와 통신하고 데이터를 활용하는 것들을 직접 만들며 배우게 됐습니다.",
    ],
  },
  {
    id: 7,
    name: "풀스택을 목표로",
    description: [
      "프론트엔드 영역에서도 답답한 부분이 많았습니다. 실제 운영되는 서비스에서는 클라이언트 영역만 가지고 할 수 있는 한계가 있기 때문이었습니다. 그래서 서버 영역의 개발에 대해 공부하고 싶습니다.",
      "늘 답답함이 새로운 길로 이끌었던 것 같습니다. A-Z로 제가 몸담은 영역에 대해 이해하고 싶습니다. 여태 그래왔듯, 앞으로도 새로운 것을 배워나가는 사람이 되려 합니다.",
    ],
  },
];
